# Python and MySQL I

After having done some online courses on MySQL, I wanted to get some practice on running queries but combining Python with MySQL. After having found some resources to enable me to run queries from a Jupyter Notebook, I decided to get some practice creating a table and then running some basic queries from this table. This notebook may be used as a tutorial since it will provide a reference on how to run various queries. The focus on this project is getting comfortable with running queries using the SELECT, FROM, WHERE, ORDER BY, and LIMIT clauses. There is some practice with using logical operators along with some practice with string Functions. Each code cell with a query begins with a short description of the task followed by the query to print out the desired output. The goal of each subsequent project is to help potentially add more skills to whoever may be using these as a guide. Each project will involve more complex queries. The data in this table is fictional, but it still provides a way to practice writing SQL queries. 

Topics and clauses covered in this project:
* CREATE
* INSERT
* SELECT
* FROM
* LIMIT
* WHERE
* ORDER BY 
* DISTINCT
* LIKE
* LOGICAL OPERATORS (AND, OR)
* IS NULL
* IS NOT NULL
* IN
* Various string functions

In [1]:
import mysql.connector
mydb = mysql.connector.connect(host='127.0.0.1', user='HIDDEN', password='HIDDEN', database = 'python_fitness',use_pure=True)
print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000002288B976148>

In [2]:
mysql = mydb.cursor(buffered = True)

In [3]:
# mysql.execute('CREATE DATABASE python_fitness')

In [ ]:
mysql.execute("CREATE TABLE trainers (id INT AUTO_INCREMENT PRIMARY KEY, first_name VARCHAR(40) NOT NULL, last_name VARCHAR(40),\
 age INT, gender CHAR(1), ranking VARCHAR(20) DEFAULT 'PT1', number_of_clients INT, personality VARCHAR(20) NOT NULL)")

In [ ]:
sql =  "INSERT INTO trainers (first_name, last_name, age, gender, ranking, number_of_clients, personality) \
VALUES (%s, %s, %s, %s, %s, %s, %s)" 
value = ('Jack', 'Rabbit', 41, 'M', 'PT3', 44, 'extrovert')
mysql.execute(sql, value)
mydb.commit()
print(mysql.rowcount, "record(s) inserted.")

In [4]:
sql = 'SELECT * FROM trainers'
mysql.execute(sql)
result = mysql.fetchall()
for x in result:
    print(x)

(1, 'Jack', 'Rabbit', 41, 'M', 'PT3', 44, 'extrovert', None)
(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', None)
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', None)
(4, 'Mike', 'Wilkersand', 29, 'M', 'PT3', 22, 'extrovert', None)
(5, 'James', 'Pelowski', 31, 'M', 'PT2', 8, 'introvert', None)
(6, 'Sandra', 'Nicholes', 28, 'F', 'PT1', 5, 'introvert', None)
(7, 'Kate', 'Kalowski', 41, 'F', 'Master Trainer', 33, 'extrovert', None)
(8, 'Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert', None)
(9, 'John', 'Earnst', 21, 'M', 'PT3', 17, 'extrovert', None)
(10, 'Tate', 'Michaels', 23, 'M', 'PT3', 20, 'extrovert', None)
(11, 'Barbara', 'Vivoski', 27, 'F', 'Master Trainer', 26, 'extrovert', None)
(12, 'Wilmer', 'Smith', 24, 'M', 'PT1', 2, 'introvert', None)
(13, 'Bart', 'Solemny', 33, 'M', 'PT3', 18, 'introvert', None)
(14, 'Jennifer', 'Shulz', 28, 'F', 'Master Trainer', 1, 'extrovert', None)
(15, 'Camaryn', 'Coops', 21, 'F', 'PT1', 3, 'extrovert', None)
(16, 'Sandra', 'Livingston', 31, 'F', 'Master Trainer', 11, 'introvert', None)
(17, 'Brad', 'Wiggins', 25, 'M', 'PT3', 19, 'extrovert', None)
(18, 'Shelby', 'Thorp', 32, 'F', 'PT2', 8, 'introvert', None)
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', None)
(20, 'Sally', 'Mae', 61, 'F', 'Master Trainer', 2, 'extrovert', None)

In [ ]:
sql = "INSERT INTO trainers (first_name, last_name, age, gender, ranking, number_of_clients, personality) \
VALUES (%s, %s, %s, %s, %s, %s, %s)" 
values = [
    ('Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert'), \
    ('Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert'), \
    ('Mike', 'Wilkersand', 29, 'M', 'PT3', 22, 'extrovert'), \
    ('James', 'Pelowski', 31, 'M', 'PT2', 8, 'introvert'), \
    ('Sandra', 'Nicholes', 28, 'F', 'PT1', 5, 'introvert'), \
    ('Kate', 'Kalowski', 41, 'F', 'Master Trainer', 33, 'extrovert'), \
    ('Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert'), \
    ('John', 'Earnst', 21, 'M', 'PT3', 17, 'extrovert'), \
    ('Tate', 'Michaels', 23, 'M', 'PT3', 20, 'extrovert'), \
    ('Barbara', 'Vivoski', 27, 'F', 'Master Trainer', 26, 'extrovert'), \
    ('Wilmer', 'Smith', 24, 'M', 'PT1', 2, 'introvert'), \
    ('Bart', 'Solemny', 33, 'M', 'PT3', 18, 'introvert'), \
    ('Jennifer', 'Shulz', 28, 'F', 'Master Trainer', 1, 'extrovert'), \
    ('Camaryn', 'Coops', 21, 'F', 'PT1', 3, 'extrovert'), \
    ('Sandra', 'Livingston', 31, 'F', 'Master Trainer', 11, 'introvert'), \
    ('Brad', 'Wiggins', 25, 'M', 'PT3', 19, 'extrovert'), \
    ('Shelby', 'Thorp', 32, 'F', 'PT2', 8, 'introvert'), \
    ('Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert'), \
    ('Sally', 'Mae', 61, 'F', 'Master Trainer', 2, 'extrovert')
]
mysql.executemany(sql, values)
mydb.commit()
print(mysql.rowcount, 'record(s) inserted.')

In [5]:
# Display only the first 10 rows of data with all columns printed out
sql = 'SELECT * FROM trainers LIMIT 10'
mysql.execute(sql)
result = mysql.fetchall()
for x in result:
    print(x)

(1, 'Jack', 'Rabbit', 41, 'M', 'PT3', 44, 'extrovert', None)
(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', None)
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', None)
(4, 'Mike', 'Wilkersand', 29, 'M', 'PT3', 22, 'extrovert', None)
(5, 'James', 'Pelowski', 31, 'M', 'PT2', 8, 'introvert', None)
(6, 'Sandra', 'Nicholes', 28, 'F', 'PT1', 5, 'introvert', None)
(7, 'Kate', 'Kalowski', 41, 'F', 'Master Trainer', 33, 'extrovert', None)
(8, 'Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert', None)
(9, 'John', 'Earnst', 21, 'M', 'PT3', 17, 'extrovert', None)
(10, 'Tate', 'Michaels', 23, 'M', 'PT3', 20, 'extrovert', None)

In [6]:
# Selecing only the first and last columns along with the ranking column limit the result to only the first 8 rows
sql = 'Select first_name, last_name, ranking FROM trainers LIMIT 8'
mysql.execute(sql)
result = mysql.fetchall()
for x in result:
    print(x)

('Jack', 'Rabbit', 'PT3')
('Donlee', 'Milar', 'Master Trainer')
('Vanessa', 'Cortez', 'Master Trainer')
('Mike', 'Wilkersand', 'PT3')
('James', 'Pelowski', 'PT2')
('Sandra', 'Nicholes', 'PT1')
('Kate', 'Kalowski', 'Master Trainer')
('Earnest', 'Finsky', 'PT2')

In [7]:
sql =  "SELECT * FROM trainers WHERE ranking = 'Master Trainer'"
mysql.execute(sql)
result = mysql.fetchall()
for x in result:
    print(x)

(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', None)
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', None)
(7, 'Kate', 'Kalowski', 41, 'F', 'Master Trainer', 33, 'extrovert', None)
(11, 'Barbara', 'Vivoski', 27, 'F', 'Master Trainer', 26, 'extrovert', None)
(14, 'Jennifer', 'Shulz', 28, 'F', 'Master Trainer', 1, 'extrovert', None)
(16, 'Sandra', 'Livingston', 31, 'F', 'Master Trainer', 11, 'introvert', None)
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', None)
(20, 'Sally', 'Mae', 61, 'F', 'Master Trainer', 2, 'extrovert', None)

In [8]:
# To prevent SQL injection store the query value in a separate variable
# The trainer's ranking we want to select is assigned to a variable named ranking
sql = 'SELECT * FROM  trainers WHERE ranking = %s'
ranking = ('Master Trainer', )
mysql.execute(sql, ranking)
result = mysql.fetchall()
for x in result:
    print(x)

(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', None)
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', None)
(7, 'Kate', 'Kalowski', 41, 'F', 'Master Trainer', 33, 'extrovert', None)
(11, 'Barbara', 'Vivoski', 27, 'F', 'Master Trainer', 26, 'extrovert', None)
(14, 'Jennifer', 'Shulz', 28, 'F', 'Master Trainer', 1, 'extrovert', None)
(16, 'Sandra', 'Livingston', 31, 'F', 'Master Trainer', 11, 'introvert', None)
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', None)
(20, 'Sally', 'Mae', 61, 'F', 'Master Trainer', 2, 'extrovert', None)

Since this MySQL project/tutorial or practice session consists of working with fake data that I created, parameterized queries are will not be necessary. However, when working with real data that can contain sensitive information the use of parameterized queries to prevent SQL injection should be highly considered. 

The main purpose of this project is to demonstrate knowledge in connecting MySQL with a Jupyter notebook and being able to run queries successfully. The SQL queries will start of as basic and progress into more complex queries.

In [9]:
# Select the first name, last name, and age columns and order by age descending (oldest to youngest)
sql =  "SELECT first_name, last_name, age FROM trainers \
ORDER BY age DESC"
mysql.execute(sql)
result = mysql.fetchall()
for x in result:
    print(x)

('Sally', 'Mae', 61)
('Earnest', 'Finsky', 48)
('Donlee', 'Milar', 45)
('Jack', 'Rabbit', 41)
('Kate', 'Kalowski', 41)
('Sean', 'Smith', 41)
('Vanessa', 'Cortez', 38)
('Bart', 'Solemny', 33)
('Shelby', 'Thorp', 32)
('James', 'Pelowski', 31)
('Sandra', 'Livingston', 31)
('Mike', 'Wilkersand', 29)
('Sandra', 'Nicholes', 28)
('Jennifer', 'Shulz', 28)
('Barbara', 'Vivoski', 27)
('Brad', 'Wiggins', 25)
('Wilmer', 'Smith', 24)
('Tate', 'Michaels', 23)
('John', 'Earnst', 21)
('Camaryn', 'Coops', 21)

In [10]:
# Using the DISTINCT statement to find out the different trainer rankings
sql = 'SELECT DISTINCT ranking FROM trainers'
mysql.execute(sql)
result = mysql.fetchall()
for x in result:
    print(x)

('PT3',)
('Master Trainer',)
('PT2',)
('PT1',)

In [11]:
# Select only the data where the trainer is an introvert and order the results by the number of clients descending
sql = 'SELECT * FROM trainers \
WHERE personality = "introvert" ORDER BY number_of_clients DESC'
mysql.execute(sql)
result = mysql.fetchall()
for x in result:
    print(x)

(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', None)
(13, 'Bart', 'Solemny', 33, 'M', 'PT3', 18, 'introvert', None)
(16, 'Sandra', 'Livingston', 31, 'F', 'Master Trainer', 11, 'introvert', None)
(5, 'James', 'Pelowski', 31, 'M', 'PT2', 8, 'introvert', None)
(18, 'Shelby', 'Thorp', 32, 'F', 'PT2', 8, 'introvert', None)
(6, 'Sandra', 'Nicholes', 28, 'F', 'PT1', 5, 'introvert', None)
(8, 'Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert', None)
(12, 'Wilmer', 'Smith', 24, 'M', 'PT1', 2, 'introvert', None)
(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', None)

In [3]:
# Typing this repetitive code is time consuming, I will create a function as a remedy. 
def query(sql):
    mysql.execute(sql)
    result = mysql.fetchall()
    for x in result:
        print(x)

In [13]:
# Testing out the function with simple query limiting the results to five
query('SELECT * FROM trainers LIMIT 5')

(1, 'Jack', 'Rabbit', 41, 'M', 'PT3', 44, 'extrovert', None)
(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', None)
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', None)
(4, 'Mike', 'Wilkersand', 29, 'M', 'PT3', 22, 'extrovert', None)
(5, 'James', 'Pelowski', 31, 'M', 'PT2', 8, 'introvert', None)

In [14]:
# Concatenate the first and last name columns 
query('SELECT CONCAT(first_name, " ", last_name) FROM trainers') # " " prevents the name from displaying like JackRabbit

('Jack Rabbit',)
('Donlee Milar',)
('Vanessa Cortez',)
('Mike Wilkersand',)
('James Pelowski',)
('Sandra Nicholes',)
('Kate Kalowski',)
('Earnest Finsky',)
('John Earnst',)
('Tate Michaels',)
('Barbara Vivoski',)
('Wilmer Smith',)
('Bart Solemny',)
('Jennifer Shulz',)
('Camaryn Coops',)
('Sandra Livingston',)
('Brad Wiggins',)
('Shelby Thorp',)
('Sean Smith',)
('Sally Mae',)

In [15]:
# Expand on the above query to write out a sentence stating how many clients each trainer has.
query('SELECT CONCAT(first_name, " ", last_name, " ", "has", " ", number_of_clients, " ", "clients.") FROM trainers')

('Jack Rabbit has 44 clients.',)
('Donlee Milar has 0 clients.',)
('Vanessa Cortez has 45 clients.',)
('Mike Wilkersand has 22 clients.',)
('James Pelowski has 8 clients.',)
('Sandra Nicholes has 5 clients.',)
('Kate Kalowski has 33 clients.',)
('Earnest Finsky has 3 clients.',)
('John Earnst has 17 clients.',)
('Tate Michaels has 20 clients.',)
('Barbara Vivoski has 26 clients.',)
('Wilmer Smith has 2 clients.',)
('Bart Solemny has 18 clients.',)
('Jennifer Shulz has 1 clients.',)
('Camaryn Coops has 3 clients.',)
('Sandra Livingston has 11 clients.',)
('Brad Wiggins has 19 clients.',)
('Shelby Thorp has 8 clients.',)
('Sean Smith has 31 clients.',)
('Sally Mae has 2 clients.',)

In [16]:
# Using the LIKE operator to only print out trainers that have have a last name ending in 'ski'
query('SELECT first_name, last_name FROM trainers \
WHERE last_name LIKE "%ski"')

('James', 'Pelowski')
('Kate', 'Kalowski')
('Barbara', 'Vivoski')

In [17]:
# Adding another column to the trainers table by using the ALTER TABLE statement
# mysql.execute('ALTER TABLE trainers ADD COLUMN education VARCHAR(30)')

In [18]:
# Using the DESC statement allows you to see the columns in your table along with the data types each column accepts
query('DESC trainers')

('id', 'int', 'NO', 'PRI', None, 'auto_increment')
('first_name', 'varchar(40)', 'NO', '', None, '')
('last_name', 'varchar(40)', 'YES', '', None, '')
('age', 'int', 'YES', '', None, '')
('gender', 'char(1)', 'YES', '', None, '')
('ranking', 'varchar(20)', 'YES', '', 'PT1', '')
('number_of_clients', 'int', 'YES', '', None, '')
('personality', 'varchar(20)', 'NO', '', None, '')
('education', 'varchar(30)', 'YES', '', None, '')

In [19]:
# Displaying all data from the trainers table
query('SELECT * FROM trainers')

(1, 'Jack', 'Rabbit', 41, 'M', 'PT3', 44, 'extrovert', None)
(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', None)
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', None)
(4, 'Mike', 'Wilkersand', 29, 'M', 'PT3', 22, 'extrovert', None)
(5, 'James', 'Pelowski', 31, 'M', 'PT2', 8, 'introvert', None)
(6, 'Sandra', 'Nicholes', 28, 'F', 'PT1', 5, 'introvert', None)
(7, 'Kate', 'Kalowski', 41, 'F', 'Master Trainer', 33, 'extrovert', None)
(8, 'Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert', None)
(9, 'John', 'Earnst', 21, 'M', 'PT3', 17, 'extrovert', None)
(10, 'Tate', 'Michaels', 23, 'M', 'PT3', 20, 'extrovert', None)
(11, 'Barbara', 'Vivoski', 27, 'F', 'Master Trainer', 26, 'extrovert', None)
(12, 'Wilmer', 'Smith', 24, 'M', 'PT1', 2, 'introvert', None)
(13, 'Bart', 'Solemny', 33, 'M', 'PT3', 18, 'introvert', None)
(14, 'Jennifer', 'Shulz', 28, 'F', 'Master Trainer', 1, 'extrovert', None)
(15, 'Camaryn', 'Coops', 21, 'F', 'PT1', 3, 'extrovert', None)
(16, 'Sandra', 'Livingston', 31, 'F', 'Master Trainer', 11, 'introvert', None)
(17, 'Brad', 'Wiggins', 25, 'M', 'PT3', 19, 'extrovert', None)
(18, 'Shelby', 'Thorp', 32, 'F', 'PT2', 8, 'introvert', None)
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', None)
(20, 'Sally', 'Mae', 61, 'F', 'Master Trainer', 2, 'extrovert', None)

In the next few code cells, I will be inserting values into the education column by using the UPDATE statement along with using the IN, NOT, OR, & AND operators to select multiple values from the first_name column to insert the education level.

In [24]:
# Adding in some values to the education column. As of now all values are None (Null) in the education column
mysql.execute("UPDATE trainers SET education = 'Doctorate' \
WHERE first_name IN ('Vanessa', 'Earnest', 'Sean')")
mydb.commit() # Must use this command to have changes applied to the MySQL database

In [25]:
# Inspecting to see that I updated the table successfully 
query('SELECT * FROM trainers WHERE education = "Doctorate"')

(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', 'Doctorate')
(8, 'Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert', 'Doctorate')
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', 'Doctorate')

In [33]:
# Assigning an education level of Master's using the AND operator
mysql.execute("UPDATE trainers SET education = 'Master'\
WHERE last_name = 'Milar' OR ranking = 'PT3'")
mydb.commit()

In [34]:
# Select only the columns that have an education level listed by using the OR operator
query("SELECT * FROM trainers \
WHERE education = 'Doctorate' OR education = 'Master'")

(1, 'Jack', 'Rabbit', 41, 'M', 'PT3', 44, 'extrovert', 'Master')
(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', 'Master')
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', 'Doctorate')
(4, 'Mike', 'Wilkersand', 29, 'M', 'PT3', 22, 'extrovert', 'Master')
(8, 'Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert', 'Doctorate')
(9, 'John', 'Earnst', 21, 'M', 'PT3', 17, 'extrovert', 'Master')
(10, 'Tate', 'Michaels', 23, 'M', 'PT3', 20, 'extrovert', 'Master')
(13, 'Bart', 'Solemny', 33, 'M', 'PT3', 18, 'introvert', 'Master')
(17, 'Brad', 'Wiggins', 25, 'M', 'PT3', 19, 'extrovert', 'Master')
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', 'Doctorate')

In [36]:
# Figuring out where there are still Null values in the education column by using the IS NULL syntax
query("SELECT * FROM trainers \
WHERE education IS NULL")

(5, 'James', 'Pelowski', 31, 'M', 'PT2', 8, 'introvert', None)
(6, 'Sandra', 'Nicholes', 28, 'F', 'PT1', 5, 'introvert', None)
(7, 'Kate', 'Kalowski', 41, 'F', 'Master Trainer', 33, 'extrovert', None)
(11, 'Barbara', 'Vivoski', 27, 'F', 'Master Trainer', 26, 'extrovert', None)
(12, 'Wilmer', 'Smith', 24, 'M', 'PT1', 2, 'introvert', None)
(14, 'Jennifer', 'Shulz', 28, 'F', 'Master Trainer', 1, 'extrovert', None)
(15, 'Camaryn', 'Coops', 21, 'F', 'PT1', 3, 'extrovert', None)
(16, 'Sandra', 'Livingston', 31, 'F', 'Master Trainer', 11, 'introvert', None)
(18, 'Shelby', 'Thorp', 32, 'F', 'PT2', 8, 'introvert', None)
(20, 'Sally', 'Mae', 61, 'F', 'Master Trainer', 2, 'extrovert', None)

In [37]:
# We can figure out which columns do not have a Null value in the education column bu using the IS NOT NULL syntax
query("SELECT * FROM trainers \
WHERE education IS NOT NULL")

(1, 'Jack', 'Rabbit', 41, 'M', 'PT3', 44, 'extrovert', 'Master')
(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', 'Master')
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', 'Doctorate')
(4, 'Mike', 'Wilkersand', 29, 'M', 'PT3', 22, 'extrovert', 'Master')
(8, 'Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert', 'Doctorate')
(9, 'John', 'Earnst', 21, 'M', 'PT3', 17, 'extrovert', 'Master')
(10, 'Tate', 'Michaels', 23, 'M', 'PT3', 20, 'extrovert', 'Master')
(13, 'Bart', 'Solemny', 33, 'M', 'PT3', 18, 'introvert', 'Master')
(17, 'Brad', 'Wiggins', 25, 'M', 'PT3', 19, 'extrovert', 'Master')
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', 'Doctorate')

In [39]:
# Updating the trainers table by assigning an education of 'Bachelor' for rows that had a Null value in the education column
mysql.execute("UPDATE trainers SET education = 'Bachelor' \
WHERE education IS NULL")
mydb.commit()

In [40]:
# Checking to see that there are no null values by using the COUNT() function. This should return 0
query('SELECT COUNT(*) FROM trainers \
WHERE education IS NULL')

(0,)

In [47]:
# Using the OR operator to filter the results
# Select only last names that end in 'ski', and begin with T and end with p, or have a ranking of PT1
# Trainers that have last names ending with 'ski', or a last name of Thorp, or a ranking of PT1 should be printed out.
query("SELECT first_name, last_name, ranking FROM trainers \
WHERE (last_name LIKE '%ski' OR last_name LIKE 'T%p') OR ranking = 'PT1'")

('James', 'Pelowski', 'PT2')
('Sandra', 'Nicholes', 'PT1')
('Kate', 'Kalowski', 'Master Trainer')
('Barbara', 'Vivoski', 'Master Trainer')
('Wilmer', 'Smith', 'PT1')
('Camaryn', 'Coops', 'PT1')
('Shelby', 'Thorp', 'PT2')

In [49]:
# Using the AND operator to filter results
# Select only rows where the trainer is female and has a Bachelor degree
query('SELECT first_name, last_name, ranking, education FROM trainers \
WHERE education = "Bachelor" AND gender = "F"')

('Sandra', 'Nicholes', 'PT1', 'Bachelor')
('Kate', 'Kalowski', 'Master Trainer', 'Bachelor')
('Barbara', 'Vivoski', 'Master Trainer', 'Bachelor')
('Jennifer', 'Shulz', 'Master Trainer', 'Bachelor')
('Camaryn', 'Coops', 'PT1', 'Bachelor')
('Sandra', 'Livingston', 'Master Trainer', 'Bachelor')
('Shelby', 'Thorp', 'PT2', 'Bachelor')
('Sally', 'Mae', 'Master Trainer', 'Bachelor')

In [50]:
# Expand on the above query but only include males if they have at least a Doctorate degree
query("SELECT first_name, last_name, gender, education FROM trainers \
where (education  = 'Bachelor' AND gender = 'F') OR education = 'Doctorate'")

('Vanessa', 'Cortez', 'F', 'Doctorate')
('Sandra', 'Nicholes', 'F', 'Bachelor')
('Kate', 'Kalowski', 'F', 'Bachelor')
('Earnest', 'Finsky', 'M', 'Doctorate')
('Barbara', 'Vivoski', 'F', 'Bachelor')
('Jennifer', 'Shulz', 'F', 'Bachelor')
('Camaryn', 'Coops', 'F', 'Bachelor')
('Sandra', 'Livingston', 'F', 'Bachelor')
('Shelby', 'Thorp', 'F', 'Bachelor')
('Sean', 'Smith', 'M', 'Doctorate')
('Sally', 'Mae', 'F', 'Bachelor')

In [16]:
# Select only those with last name of 'Coops' or a last name of 'Smith' but only if they have a Doctorate
query('SELECT * FROM trainers \
WHERE last_name = "Coops" OR last_name = "Smith" AND education = "Doctorate"')
# Notice how 'Coops' is returned, but has a Bachelor degree. We only wanted those with a Doctorate returned.
# This is where it helps to understand the logical operator precedence. 'And' has higher precedence than 'OR'.

(15, 'Camaryn', 'Coops', 21, 'F', 'PT1', 3, 'extrovert', 'Bachelor')
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', 'Doctorate')

In [17]:
# This time I will put parentheses to change the order of precedence
query('SELECT * FROM trainers \
WHERE (last_name = "Coops" OR last_name = "Smith") AND education = "Doctorate"')

(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', 'Doctorate')

In [26]:
# I will be using the IN statement to select multiple values. This can be used in place of having to use several 'ORs'
# I will only select those with a Bachelor or Master degree.
# The results will further be filtered to only include those with a ranking of PT1 or Master Trainer

query("SELECT first_name, last_name, education, ranking \
FROM trainers \
WHERE (ranking IN ('PT1', 'Master Trainer')) AND (education IN ('Bachelor', 'Master'))")

('Donlee', 'Milar', 'Master', 'Master Trainer')
('Sandra', 'Nicholes', 'Bachelor', 'PT1')
('Kate', 'Kalowski', 'Bachelor', 'Master Trainer')
('Barbara', 'Vivoski', 'Bachelor', 'Master Trainer')
('Wilmer', 'Smith', 'Bachelor', 'PT1')
('Jennifer', 'Shulz', 'Bachelor', 'Master Trainer')
('Camaryn', 'Coops', 'Bachelor', 'PT1')
('Sandra', 'Livingston', 'Bachelor', 'Master Trainer')
('Sally', 'Mae', 'Bachelor', 'Master Trainer')

In [27]:
# Writing the same query as above but this time using NOT IN
query("SELECT first_name, last_name, education, ranking \
FROM trainers \
WHERE (ranking NOT IN ('PT1', 'Master Trainer')) AND (education NOT IN ('Bachelor', 'Master'))")

('Earnest', 'Finsky', 'Doctorate', 'PT2')

In [63]:
# Who has the longest name (including both first and last name)?
# First, I will query the length for each first name using CHAR_LENGTH() function
query("SELECT first_name, last_name, CHAR_LENGTH(first_name) \
FROM trainers")

('Jack', 'Rabbit', 4)
('Donlee', 'Milar', 6)
('Vanessa', 'Cortez', 7)
('Mike', 'Wilkersand', 4)
('James', 'Pelowski', 5)
('Sandra', 'Nicholes', 6)
('Kate', 'Kalowski', 4)
('Earnest', 'Finsky', 7)
('John', 'Earnst', 4)
('Tate', 'Michaels', 4)
('Barbara', 'Vivoski', 7)
('Wilmer', 'Smith', 6)
('Bart', 'Solemny', 4)
('Jennifer', 'Shulz', 8)
('Camaryn', 'Coops', 7)
('Sandra', 'Livingston', 6)
('Brad', 'Wiggins', 4)
('Shelby', 'Thorp', 6)
('Sean', 'Smith', 4)
('Sally', 'Mae', 5)

In [4]:
# Defining a new function that also returns the column names that are selected
def query2(sql):
    mysql.execute(sql)
    result = mysql.fetchall()
    num_fields = len(mysql.description)
    field_names = [i[0] for i in mysql.description] # Will display the column names that are selected
    print(field_names)
    for x in result:
        print(x)

In [9]:
# Testing out the function
query2("Select * FROM trainers")

['id', 'first_name', 'last_name', 'age', 'gender', 'ranking', 'number_of_clients', 'personality', 'education']
(1, 'Jack', 'Rabbit', 41, 'M', 'PT3', 44, 'extrovert', 'Master')
(2, 'Donlee', 'Milar', 45, 'M', 'Master Trainer', 0, 'introvert', 'Master')
(3, 'Vanessa', 'Cortez', 38, 'F', 'Master Trainer', 45, 'extrovert', 'Doctorate')
(4, 'Mike', 'Wilkersand', 29, 'M', 'PT3', 22, 'extrovert', 'Master')
(5, 'James', 'Pelowski', 31, 'M', 'PT2', 8, 'introvert', 'Bachelor')
(6, 'Sandra', 'Nicholes', 28, 'F', 'PT1', 5, 'introvert', 'Bachelor')
(7, 'Kate', 'Kalowski', 41, 'F', 'Master Trainer', 33, 'extrovert', 'Bachelor')
(8, 'Earnest', 'Finsky', 48, 'M', 'PT2', 3, 'introvert', 'Doctorate')
(9, 'John', 'Earnst', 21, 'M', 'PT3', 17, 'extrovert', 'Master')
(10, 'Tate', 'Michaels', 23, 'M', 'PT3', 20, 'extrovert', 'Master')
(11, 'Barbara', 'Vivoski', 27, 'F', 'Master Trainer', 26, 'extrovert', 'Bachelor')
(12, 'Wilmer', 'Smith', 24, 'M', 'PT1', 2, 'introvert', 'Bachelor')
(13, 'Bart', 'Solemny', 33, 'M', 'PT3', 18, 'introvert', 'Master')
(14, 'Jennifer', 'Shulz', 28, 'F', 'Master Trainer', 1, 'extrovert', 'Bachelor')
(15, 'Camaryn', 'Coops', 21, 'F', 'PT1', 3, 'extrovert', 'Bachelor')
(16, 'Sandra', 'Livingston', 31, 'F', 'Master Trainer', 11, 'introvert', 'Bachelor')
(17, 'Brad', 'Wiggins', 25, 'M', 'PT3', 19, 'extrovert', 'Master')
(18, 'Shelby', 'Thorp', 32, 'F', 'PT2', 8, 'introvert', 'Bachelor')
(19, 'Sean', 'Smith', 41, 'M', 'Master Trainer', 31, 'introvert', 'Doctorate')
(20, 'Sally', 'Mae', 61, 'F', 'Master Trainer', 2, 'extrovert', 'Bachelor')

In [10]:
# Writing out a query that uses aliases and prints out both first and last name along with the length for both.
query2("Select first_name, last_name, CHAR_LENGTH(first_name) AS 'First name length', \
CHAR_LENGTH(last_name) AS 'Last name length' FROM trainers")

['first_name', 'last_name', 'First name length', 'Last name length']
('Jack', 'Rabbit', 4, 6)
('Donlee', 'Milar', 6, 5)
('Vanessa', 'Cortez', 7, 6)
('Mike', 'Wilkersand', 4, 10)
('James', 'Pelowski', 5, 8)
('Sandra', 'Nicholes', 6, 8)
('Kate', 'Kalowski', 4, 8)
('Earnest', 'Finsky', 7, 6)
('John', 'Earnst', 4, 6)
('Tate', 'Michaels', 4, 8)
('Barbara', 'Vivoski', 7, 7)
('Wilmer', 'Smith', 6, 5)
('Bart', 'Solemny', 4, 7)
('Jennifer', 'Shulz', 8, 5)
('Camaryn', 'Coops', 7, 5)
('Sandra', 'Livingston', 6, 10)
('Brad', 'Wiggins', 4, 7)
('Shelby', 'Thorp', 6, 5)
('Sean', 'Smith', 4, 5)
('Sally', 'Mae', 5, 3)

In [32]:
# Writing a query that totals up the number of letter in both the first and last name
query2("SELECT (CHAR_LENGTH(first_name) + CHAR_LENGTH(last_name)) AS number_of_letters FROM trainers")

['number_of_letters']
(10,)
(11,)
(13,)
(14,)
(13,)
(14,)
(12,)
(13,)
(10,)
(12,)
(14,)
(11,)
(11,)
(13,)
(12,)
(16,)
(11,)
(11,)
(9,)
(8,)

In [37]:
# Writing a query that will put it all together in a setence format like so and order the results by longest name
# Jack Rabbit contains 10 letters.
query2("SELECT CONCAT(first_name, ' ', last_name, ' contains ', (CHAR_LENGTH(first_name) + CHAR_LENGTH(last_name)), \
' letters.') AS 'Data' FROM trainers \
ORDER BY (CHAR_LENGTH(first_name) + CHAR_LENGTH(last_name)) DESC")

['Data']
('Sandra Livingston contains 16 letters.',)
('Mike Wilkersand contains 14 letters.',)
('Sandra Nicholes contains 14 letters.',)
('Barbara Vivoski contains 14 letters.',)
('Vanessa Cortez contains 13 letters.',)
('James Pelowski contains 13 letters.',)
('Earnest Finsky contains 13 letters.',)
('Jennifer Shulz contains 13 letters.',)
('Kate Kalowski contains 12 letters.',)
('Tate Michaels contains 12 letters.',)
('Camaryn Coops contains 12 letters.',)
('Donlee Milar contains 11 letters.',)
('Wilmer Smith contains 11 letters.',)
('Bart Solemny contains 11 letters.',)
('Brad Wiggins contains 11 letters.',)
('Shelby Thorp contains 11 letters.',)
('Jack Rabbit contains 10 letters.',)
('John Earnst contains 10 letters.',)
('Sean Smith contains 9 letters.',)
('Sally Mae contains 8 letters.',)

In [52]:
# Return only the first letter of both the first and last name as one column and order by last name alphabetically
# Format should be as follows: A.B.
query2("SELECT CONCAT(LEFT(first_name, 1), '.', LEFT(last_name, 1), '.') AS 'Abreviated Name' FROM trainers \
ORDER BY LEFT(last_name, 1)")

['Abreviated Name']
('V.C.',)
('C.C.',)
('J.E.',)
('E.F.',)
('K.K.',)
('S.L.',)
('D.M.',)
('T.M.',)
('S.M.',)
('S.N.',)
('J.P.',)
('J.R.',)
('W.S.',)
('B.S.',)
('J.S.',)
('S.S.',)
('S.T.',)
('B.V.',)
('M.W.',)
('B.W.',)

In [54]:
# Return first and last name, then first and last name concatenated and reversed.
query2("SELECT first_name, last_name, CONCAT(REVERSE(first_name), ' ', REVERSE(last_name)) AS Reversed FROM trainers")

['first_name', 'last_name', 'Reversed']
('Jack', 'Rabbit', 'kcaJ tibbaR')
('Donlee', 'Milar', 'eelnoD raliM')
('Vanessa', 'Cortez', 'assenaV zetroC')
('Mike', 'Wilkersand', 'ekiM dnasrekliW')
('James', 'Pelowski', 'semaJ ikswoleP')
('Sandra', 'Nicholes', 'ardnaS selohciN')
('Kate', 'Kalowski', 'etaK ikswolaK')
('Earnest', 'Finsky', 'tsenraE yksniF')
('John', 'Earnst', 'nhoJ tsnraE')
('Tate', 'Michaels', 'etaT sleahciM')
('Barbara', 'Vivoski', 'arabraB iksoviV')
('Wilmer', 'Smith', 'remliW htimS')
('Bart', 'Solemny', 'traB ynmeloS')
('Jennifer', 'Shulz', 'refinneJ zluhS')
('Camaryn', 'Coops', 'nyramaC spooC')
('Sandra', 'Livingston', 'ardnaS notsgniviL')
('Brad', 'Wiggins', 'darB sniggiW')
('Shelby', 'Thorp', 'yblehS prohT')
('Sean', 'Smith', 'naeS htimS')
('Sally', 'Mae', 'yllaS eaM')

In [55]:
# Return the name Jack Rabbit 10 times. The format should be Jack Rabbit Jack Rabbit... * 10
# Note the location of CONCAT and REPEAT in both of the queries below
query2("SELECT CONCAT(REPEAT(first_name, 10), REPEAT(last_name, 10)) AS Repeated FROM trainers \
WHERE first_name = 'Jack' and last_name = 'Rabbit'")

['Repeated']
('JackJackJackJackJackJackJackJackJackJackRabbitRabbitRabbitRabbitRabbitRabbitRabbitRabbitRabbitRabbit',)

In [61]:
# Placing REPEAT outside the parentheses to get the desired result
query2("SELECT REPEAT(CONCAT(first_name, ' ', last_name, ' '), 10) AS Repeated FROM trainers \
WHERE first_name = 'Jack' and last_name = 'Rabbit'")

['Repeated']
('Jack Rabbit Jack Rabbit Jack Rabbit Jack Rabbit Jack Rabbit Jack Rabbit Jack Rabbit Jack Rabbit Jack Rabbit Jack Rabbit ',)

In [70]:
''' Return first_name, last_name, then only the first three letters of the first_name lower cased, and
the last four letters of the last name upper cased'''
query2("SELECT first_name, last_name, LOWER(SUBSTR(first_name FROM 1 FOR 3)) AS first_3, \
UPPER(SUBSTR(last_name, -4)) AS last_4 FROM trainers")

['first_name', 'last_name', 'first_3', 'last_4']
('Jack', 'Rabbit', 'jac', 'BBIT')
('Donlee', 'Milar', 'don', 'ILAR')
('Vanessa', 'Cortez', 'van', 'RTEZ')
('Mike', 'Wilkersand', 'mik', 'SAND')
('James', 'Pelowski', 'jam', 'WSKI')
('Sandra', 'Nicholes', 'san', 'OLES')
('Kate', 'Kalowski', 'kat', 'WSKI')
('Earnest', 'Finsky', 'ear', 'NSKY')
('John', 'Earnst', 'joh', 'RNST')
('Tate', 'Michaels', 'tat', 'AELS')
('Barbara', 'Vivoski', 'bar', 'OSKI')
('Wilmer', 'Smith', 'wil', 'MITH')
('Bart', 'Solemny', 'bar', 'EMNY')
('Jennifer', 'Shulz', 'jen', 'HULZ')
('Camaryn', 'Coops', 'cam', 'OOPS')
('Sandra', 'Livingston', 'san', 'STON')
('Brad', 'Wiggins', 'bra', 'GINS')
('Shelby', 'Thorp', 'she', 'HORP')
('Sean', 'Smith', 'sea', 'MITH')
('Sally', 'Mae', 'sal', '')

In [74]:
'''Return the first name and then the last name twice as one column to be able to see the changes
when using the REPLACE function. Using the REPLACE function
change the names that have "ski" as the last three letters to "sky"'''
query2("SELECT first_name, CONCAT(last_name, ' ', REPLACE(last_name, 'ski', 'sky')) AS 'ski to sky' FROM trainers")

['first_name', 'ski to sky']
('Jack', 'Rabbit Rabbit')
('Donlee', 'Milar Milar')
('Vanessa', 'Cortez Cortez')
('Mike', 'Wilkersand Wilkersand')
('James', 'Pelowski Pelowsky')
('Sandra', 'Nicholes Nicholes')
('Kate', 'Kalowski Kalowsky')
('Earnest', 'Finsky Finsky')
('John', 'Earnst Earnst')
('Tate', 'Michaels Michaels')
('Barbara', 'Vivoski Vivosky')
('Wilmer', 'Smith Smith')
('Bart', 'Solemny Solemny')
('Jennifer', 'Shulz Shulz')
('Camaryn', 'Coops Coops')
('Sandra', 'Livingston Livingston')
('Brad', 'Wiggins Wiggins')
('Shelby', 'Thorp Thorp')
('Sean', 'Smith Smith')
('Sally', 'Mae Mae')

#### Crazy query time!
Return the first_name and last_name columns as one column labeled as 'full name'. This first column will be used as a reference to make sure the query has the desired output. For the next column, only print out the second and third letters of the first name uppercased and reversed and label the column as 'reversed_2'. For the third and final column print only the three letters before the final letter of the last name upper cased and repeated three times, and label as 'repeated x 3'. Order by last name starting from the letter Z. I now wish myself luck. Upon successful completion, it will be time to create a new notebook where I will go over aggregate functions, GROUP BY AND HAVING statements, and get into some CASE statements.

In [21]:
query2("SELECT CONCAT(first_name, ' ', last_name) AS 'full name', \
REVERSE(UPPER(SUBSTR(first_name FROM 2 for 2))) AS 'reversed_2', \
REPEAT(UPPER(SUBSTR(last_name FROM -4 FOR 3)), 3) AS 'repeated x 3' FROM trainers \
ORDER BY last_name DESC")

['full name', 'reversed_2', 'repeated x 3']
('Mike Wilkersand', 'KI', 'SANSANSAN')
('Brad Wiggins', 'AR', 'GINGINGIN')
('Barbara Vivoski', 'RA', 'OSKOSKOSK')
('Shelby Thorp', 'EH', 'HORHORHOR')
('Bart Solemny', 'RA', 'EMNEMNEMN')
('Wilmer Smith', 'LI', 'MITMITMIT')
('Sean Smith', 'AE', 'MITMITMIT')
('Jennifer Shulz', 'NE', 'HULHULHUL')
('Jack Rabbit', 'CA', 'BBIBBIBBI')
('James Pelowski', 'MA', 'WSKWSKWSK')
('Sandra Nicholes', 'NA', 'OLEOLEOLE')
('Donlee Milar', 'NO', 'ILAILAILA')
('Tate Michaels', 'TA', 'AELAELAEL')
('Sally Mae', 'LA', '')
('Sandra Livingston', 'NA', 'STOSTOSTO')
('Kate Kalowski', 'TA', 'WSKWSKWSK')
('Earnest Finsky', 'RA', 'NSKNSKNSK')
('John Earnst', 'HO', 'RNSRNSRNS')
('Vanessa Cortez', 'NA', 'RTERTERTE')
('Camaryn Coops', 'MA', 'OOPOOPOOP')

This concludes part 1 of Python and MySQL.

#### Resources
* https://stackoverflow.com/questions/38400476/mysql-python-unread-result-found-when-insert-result-into-table
* https://medium.com/@tattwei46/how-to-use-python-with-mysql-79304bee8753
* https://www.semicolonworld.com/question/59047/mysql-get-column-name-or-alias-from-query
* https://dev.mysql.com/doc/refman/8.0/en/string-functions.html